In [1]:
import pandas as pd
import numpy as np

In [2]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])

In [3]:
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [4]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data = pd.Series(['aardvark', np.nan, None, 'avocado'])

In [6]:
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [7]:
string_data.isna() # for pandas None is also treated as NA

0    False
1     True
2     True
3    False
dtype: bool

<img src = './../Python/NA Handling object methods.png'>

In [8]:
from numpy import nan as NA

In [9]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [10]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [11]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data.dropna() == data[data.notna()]

0    True
2    True
4    True
dtype: bool

In [14]:
 data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [15]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
cleaned = data.dropna()

In [17]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [19]:
data.dropna(how = 'all') # If all raw are NA, drop it the raw

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [20]:
data[4] = NA

In [21]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [22]:
data.dropna(axis = 'columns')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [23]:
data.dropna(axis = 1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [24]:
data.dropna(axis = 1, how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [25]:
 df = pd.DataFrame(np.random.standard_normal((7, 3)))
 df

          0         1         2
0  1.056501  0.002820  0.604201
1 -1.471792  0.296965  0.327581
2 -0.491135  1.533134 -1.575418
3  0.887444  0.267448  1.889661
4 -1.029806  0.478508 -0.659696
5 -1.130280  3.444955  0.136540
6 -0.194172  0.393732 -0.322272

In [26]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

In [27]:
df

          0         1         2
0  1.056501       NaN       NaN
1 -1.471792       NaN       NaN
2 -0.491135       NaN -1.575418
3  0.887444       NaN  1.889661
4 -1.029806  0.478508 -0.659696
5 -1.130280  3.444955  0.136540
6 -0.194172  0.393732 -0.322272

In [28]:
df.dropna()

          0         1         2
4 -1.029806  0.478508 -0.659696
5 -1.130280  3.444955  0.136540
6 -0.194172  0.393732 -0.322272

In [29]:
df.dropna(thresh = 2) # Minimun value of NA values that it can be deleted

          0         1         2
2 -0.491135       NaN -1.575418
3  0.887444       NaN  1.889661
4 -1.029806  0.478508 -0.659696
5 -1.130280  3.444955  0.136540
6 -0.194172  0.393732 -0.322272

## Filling In Missing Data

In [30]:
df

          0         1         2
0  1.056501       NaN       NaN
1 -1.471792       NaN       NaN
2 -0.491135       NaN -1.575418
3  0.887444       NaN  1.889661
4 -1.029806  0.478508 -0.659696
5 -1.130280  3.444955  0.136540
6 -0.194172  0.393732 -0.322272

In [31]:
df.fillna(0)

          0         1         2
0  1.056501  0.000000  0.000000
1 -1.471792  0.000000  0.000000
2 -0.491135  0.000000 -1.575418
3  0.887444  0.000000  1.889661
4 -1.029806  0.478508 -0.659696
5 -1.130280  3.444955  0.136540
6 -0.194172  0.393732 -0.322272

In [32]:
df.fillna({1 : 0.5, 2 : 0}) # You can fill with different values using a dict for each column that you want to fill

          0         1         2
0  1.056501  0.500000  0.000000
1 -1.471792  0.500000  0.000000
2 -0.491135  0.500000 -1.575418
3  0.887444  0.500000  1.889661
4 -1.029806  0.478508 -0.659696
5 -1.130280  3.444955  0.136540
6 -0.194172  0.393732 -0.322272

In [33]:
df.fillna('Llenado de perros')

          0                  1                  2
0  1.056501  Llenado de perros  Llenado de perros
1 -1.471792  Llenado de perros  Llenado de perros
2 -0.491135  Llenado de perros          -1.575418
3  0.887444  Llenado de perros           1.889661
4 -1.029806           0.478508          -0.659696
5 -1.130280           3.444955            0.13654
6 -0.194172           0.393732          -0.322272

In [34]:
df.fillna(0, inplace = True)

In [35]:
df

          0         1         2
0  1.056501  0.000000  0.000000
1 -1.471792  0.000000  0.000000
2 -0.491135  0.000000 -1.575418
3  0.887444  0.000000  1.889661
4 -1.029806  0.478508 -0.659696
5 -1.130280  3.444955  0.136540
6 -0.194172  0.393732 -0.322272

In [36]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA

In [37]:
df

          0         1         2
0  0.830276 -0.474788  0.628301
1 -1.343991  1.007539 -0.451954
2  0.459256       NaN  0.014422
3  0.193815       NaN -0.816144
4 -1.528184       NaN       NaN
5  0.814677       NaN       NaN

In [38]:
df.fillna(method = 'pad')

          0         1         2
0  0.830276 -0.474788  0.628301
1 -1.343991  1.007539 -0.451954
2  0.459256  1.007539  0.014422
3  0.193815  1.007539 -0.816144
4 -1.528184  1.007539 -0.816144
5  0.814677  1.007539 -0.816144

In [39]:
df.fillna(method = 'ffill') # Fill with the last number found on the current column

          0         1         2
0  0.830276 -0.474788  0.628301
1 -1.343991  1.007539 -0.451954
2  0.459256  1.007539  0.014422
3  0.193815  1.007539 -0.816144
4 -1.528184  1.007539 -0.816144
5  0.814677  1.007539 -0.816144

<img src = './../Python/ffil-bfill.png'>

In [40]:
df

          0         1         2
0  0.830276 -0.474788  0.628301
1 -1.343991  1.007539 -0.451954
2  0.459256       NaN  0.014422
3  0.193815       NaN -0.816144
4 -1.528184       NaN       NaN
5  0.814677       NaN       NaN

In [41]:
df.fillna(method = 'ffill', limit = 2) # Fill NA values with the last value on the current column. Limit delimit how many values must be filled

          0         1         2
0  0.830276 -0.474788  0.628301
1 -1.343991  1.007539 -0.451954
2  0.459256  1.007539  0.014422
3  0.193815  1.007539 -0.816144
4 -1.528184       NaN -0.816144
5  0.814677       NaN -0.816144

In [42]:
data = pd.Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [43]:
data.fillna(data.mean()) # Ignore NA values for the mean

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

<img src = './../Python/FinllnaFunctionsArguments.png'>

## Data Transformation

### Removing duplicates

In [44]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [45]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [46]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [47]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [48]:
data['v'] = np.arange(7)

In [49]:
data

    k1  k2  v
0  one   1  0
1  two   1  1
2  one   2  2
3  two   3  3
4  one   3  4
5  two   4  5
6  two   4  6

In [50]:
data.duplicated(['k1'])

0    False
1    False
2     True
3     True
4     True
5     True
6     True
dtype: bool

In [51]:
data.drop_duplicates(['k1'])

    k1  k2  v
0  one   1  0
1  two   1  1

In [52]:
data.drop_duplicates(['k1', 'k2'], keep = 'last')

    k1  k2  v
0  one   1  0
1  two   1  1
2  one   2  2
3  two   3  3
4  one   3  4
6  two   4  6

In [53]:
data.drop_duplicates(['k1', 'k2'], keep = 'first') # first by default

    k1  k2  v
0  one   1  0
1  two   1  1
2  one   2  2
3  two   3  3
4  one   3  4
5  two   4  5

## Transforming Data Using a Function or Mapping

In [54]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [55]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [56]:
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'
}
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [57]:
lowercased = data['food'].str.lower() # Thus, we need to convert each value to lowercase using the str.lower Series method
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [58]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [59]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## Replacing Values

In [60]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [61]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [62]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [63]:
data.replace([-999, -1000], 'Aquí remplacé un número')

0                        1.0
1    Aquí remplacé un número
2                        2.0
3    Aquí remplacé un número
4    Aquí remplacé un número
5                        3.0
dtype: object

In [64]:
data.replace({-999 : 'Aquí iba un -999', -1000: 'Aquí iba un -1000'})

0                  1.0
1     Aquí iba un -999
2                  2.0
3     Aquí iba un -999
4    Aquí iba un -1000
5                  3.0
dtype: object

In [65]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), 
                    index=['Ohio', 'Colorado', 'New York'], 
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [66]:
transform = lambda x: x[:4].upper()

In [67]:
data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [68]:
data.index[1]

'Colorado'

In [69]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [70]:
data.index = data.index.map(transform)

In [71]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [72]:
data.rename(index = str.lower, columns = str.upper) #Notably, rename can be used in conjunction with a dict-like object providing new values for a subset of the axis labels

      ONE  TWO  THREE  FOUR
ohio    0    1      2     3
colo    4    5      6     7
new     8    9     10    11

In [73]:
data.rename(index ={'OHIO' : 'INDIANA'}, columns = {'three' : 'cambié el nombre de la columna'})

         one  two  cambié el nombre de la columna  four
INDIANA    0    1                               2     3
COLO       4    5                               6     7
NEW        8    9                              10    11

In [74]:
data.rename(index ={'OHIO' : 'INDIANA'}, inplace = True)

In [75]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

## Discretization and Binning

In [76]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [77]:
bins = [18, 25, 35, 60, 100]

In [78]:
cats = pd.cut(ages, bins)

In [79]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [80]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [81]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [82]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [83]:
cats.categories[0]

Interval(18, 25, closed='right')

In [84]:
cats.categories[1]

Interval(25, 35, closed='right')

In [85]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [86]:
data_change_interval = pd.cut(ages, bins, right = False) # Change the interval between two ranges

In [87]:
data_change_interval

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [88]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [89]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [90]:
x = pd.cut(ages, bins, labels = group_names)

In [91]:
x

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [92]:
data = np.random.uniform(size = 20)
y = pd.cut(data, 4, precision = 2) # The precision=2 option limits the decimal precision to two digits
y

[(0.49, 0.73], (0.73, 0.97], (0.011, 0.25], (0.011, 0.25], (0.011, 0.25], ..., (0.49, 0.73], (0.011, 0.25], (0.011, 0.25], (0.011, 0.25], (0.49, 0.73]]
Length: 20
Categories (4, interval[float64, right]): [(0.011, 0.25] < (0.25, 0.49] < (0.49, 0.73] < (0.73, 0.97]]

In [93]:
data = np.random.standard_normal(1000)

In [94]:
cats = pd.qcut(data, 4, precision = 3) # Cut int quartiles

In [95]:
cats

[(-2.759, -0.731], (-0.731, -0.0497], (-0.0497, 0.673], (-0.0497, 0.673], (-0.0497, 0.673], ..., (-0.731, -0.0497], (0.673, 2.875], (0.673, 2.875], (-2.759, -0.731], (-0.0497, 0.673]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.759, -0.731] < (-0.731, -0.0497] < (-0.0497, 0.673] < (0.673, 2.875]]

In [96]:
pd.value_counts(cats)

(-2.759, -0.731]     250
(-0.731, -0.0497]    250
(-0.0497, 0.673]     250
(0.673, 2.875]       250
dtype: int64

In [97]:
pd.qcut(data, np.arange(start = 0, stop = 1, step = 0.1), precision = 3).value_counts()

(-2.759, -1.318]     100
(-1.318, -0.892]     100
(-0.892, -0.542]     100
(-0.542, -0.293]     100
(-0.293, -0.0497]    100
(-0.0497, 0.188]     100
(0.188, 0.494]       100
(0.494, 0.847]       100
(0.847, 1.184]       100
dtype: int64

## Detecting and Filtering Outliers

In [98]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))

In [99]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.042489     0.006686     0.012246     0.014768
std       1.020545     1.006986     1.024784     1.013405
min      -3.261941    -3.429220    -3.225976    -3.125505
25%      -0.743028    -0.655030    -0.662572    -0.666326
50%      -0.062323     0.030062    -0.006601     0.025156
75%       0.679805     0.640191     0.701197     0.678701
max       4.013966     3.035402     3.441303     3.419275

In [100]:
col = data[2]

In [101]:
col[col.abs() > 3] # Numbers greater than 3

221    3.441303
508   -3.225976
Name: 2, dtype: float64

In [102]:
data[data.abs() > 3] = np.sign(data) * 3 # sign return -1 or 1 values based on wether the data are positive or negative

In [103]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.043184     0.007638     0.012030     0.013587
std       1.015362     1.003755     1.022709     1.008933
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.743028    -0.655030    -0.662572    -0.666326
50%      -0.062323     0.030062    -0.006601     0.025156
75%       0.679805     0.640191     0.701197     0.678701
max       3.000000     3.000000     3.000000     3.000000

In [104]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0 -1.0
1  1.0 -1.0  1.0  1.0
2  1.0  1.0  1.0 -1.0
3 -1.0  1.0  1.0  1.0
4 -1.0  1.0  1.0  1.0

## Permutation and Random Sampling

In [105]:
df = pd.DataFrame(np.arange(35).reshape(5, 7))

In [106]:
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [107]:
sampler = np.random.permutation(5)

In [108]:
sampler

array([4, 3, 1, 2, 0])

In [109]:
df.take(sampler) # reorder the rows with the same number of the parameters

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
3  21  22  23  24  25  26  27
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
0   0   1   2   3   4   5   6

In [110]:
df.iloc[:, np.random.permutation(7)]

    1   6   0   4   3   5   2
0   1   6   0   4   3   5   2
1   8  13   7  11  10  12   9
2  15  20  14  18  17  19  16
3  22  27  21  25  24  26  23
4  29  34  28  32  31  33  30

In [111]:
df.iloc[:, sampler] # Reorder the columns

    4   3   1   2   0
0   4   3   1   2   0
1  11  10   8   9   7
2  18  17  15  16  14
3  25  24  22  23  21
4  32  31  29  30  28

In [112]:
df.sample(n = 4) # Like permutation, but it can't replace the row or column

    0   1   2   3   4   5   6
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6
2  14  15  16  17  18  19  20

In [113]:
choices = pd.Series(np.random.randint(-10, 10, size = 5))

In [114]:
choices

0   -9
1    9
2   -3
3   -5
4    4
dtype: int32

In [115]:
draws = choices.sample(n = 10, replace = True)

In [116]:
draws

2   -3
0   -9
0   -9
0   -9
4    4
4    4
2   -3
2   -3
1    9
1    9
dtype: int32

## Computing Indicator/Dummy Variables

In [117]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [118]:
pd.get_dummies(df.key)

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [119]:
dumies = pd.get_dummies(df['key'], prefix = 'added_prefix')
dumies

   added_prefix_a  added_prefix_b  added_prefix_c
0               0               1               0
1               0               1               0
2               1               0               0
3               0               0               1
4               1               0               0
5               0               1               0

In [120]:
df.data1

0    0
1    1
2    2
3    3
4    4
5    5
Name: data1, dtype: int64

In [121]:
df['data1']

0    0
1    1
2    2
3    3
4    4
5    5
Name: data1, dtype: int64

In [122]:
df[['data1']]

   data1
0      0
1      1
2      2
3      3
4      4
5      5

In [123]:
df_with_dummy = df[['data1']].join(dumies)
df_with_dummy

   data1  added_prefix_a  added_prefix_b  added_prefix_c
0      0               0               1               0
1      1               0               1               0
2      2               1               0               0
3      3               0               0               1
4      4               1               0               0
5      5               0               1               0

In [124]:
mnames = ['movie_id', 'title', 'genres']

In [125]:
mnames

['movie_id', 'title', 'genres']

In [134]:
movies = pd.read_table('../../GitHub/pydata-book/datasets/movielens/movies.dat', sep = '::', engine = 'python', header = None, names = mnames)

In [135]:
movies

,movie_id,title,genres
0,1,Toy Story (1995),Animation|Children's|Comedy
1,2,Jumanji (1995),Adventure|Children's|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
3878,3948,Meet the Parents (2000),Comedy
3879,3949,Requiem for a Dream (2000),Drama
3880,3950,Tigerland (2000),Drama
3881,3951,Two Family House (2000),Drama
3882,3952,"Contender, The (2000)",Drama|Thriller

In [136]:
dummies = movies.genres.str.get_dummies('|')
dummies

,Action,Adventure,Animation,Children's,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0
1,0,1,0,1,0,0,0,0,1,0,0,0,0,0,0,0,0,0
2,0,0,0,0,1,0,0,0,0,0,0,0,0,1,0,0,0,0
3,0,0,0,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
3879,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3880,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3881,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
3882,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,1,0,0

In [137]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic

,movie_id,title,genres,Genre_Action,Genre_Adventure,Genre_Animation,Genre_Children's,Genre_Comedy,Genre_Crime,Genre_Documentary,...,Genre_Fantasy,Genre_Film-Noir,Genre_Horror,Genre_Musical,Genre_Mystery,Genre_Romance,Genre_Sci-Fi,Genre_Thriller,Genre_War,Genre_Western
0,1,Toy Story (1995),Animation|Children's|Comedy,0,0,1,1,1,0,0,...,0,0,0,0,0,0,0,0,0,0
1,2,Jumanji (1995),Adventure|Children's|Fantasy,0,1,0,1,0,0,0,...,1,0,0,0,0,0,0,0,0,0
2,3,Grumpier Old Men (1995),Comedy|Romance,0,0,0,0,1,0,0,...,0,0,0,0,0,1,0,0,0,0
3,4,Waiting to Exhale (1995),Comedy|Drama,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
4,5,Father of the Bride Part II (1995),Comedy,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3878,3948,Meet the Parents (2000),Comedy,0,0,0,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
3879,3949,Requiem for a Dream (2000),Drama,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3880,3950,Tigerland (2000),Drama,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3881,3951,Two Family House (2000),Drama,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3882,3952,"Contender, The (2000)",Drama|Thriller,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0

In [138]:
np.random.seed(12345)
values = np.random.uniform(size = 10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [139]:
bins =  [0, 0.2, 0.4, 0.6, 0.8, 1]

In [140]:
x = pd.get_dummies(pd.cut(values, bins))
x

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## String manipulation

In [143]:
val = 'a,b, guido'

In [144]:
val.split(',')

['a', 'b', ' guido']

In [146]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [158]:
val2 = '             s                   o                        ns,    o                            '
pieces2 = [x.strip() for x in val2.split(',')]
pieces2

['s                   o                        ns', 'o']

In [159]:
'::'.join(pieces)

'a::b::guido'

In [160]:
'''pieces.join('::')''' # AttributeError: 'list' object has no attribute 'join'

"pieces.join('::')"

In [161]:
val.index(','), val.find(':'), 'guido' in val #Note the difference between find and index is that index raises an exception if the string isn’t found (versus returning –1)

(1, -1, True)

In [162]:
val.count(',')

2

In [163]:
val2.count(' ')

88

In [164]:
val.replace(',', '::')

'a::b:: guido'

In [165]:
val.replace(',', '')

'ab guido'

In [169]:
val2.replace(' ', '').split(',')

['sons', 'o']

In [170]:
val2.replace(',', ' ').replace(' ', '')

'sonso'

<img src = './../Python/PythonBuilInStringMethods.png'>

In [171]:
import re

In [175]:
text = "foo bar\t baz \tqux"
text

'foo bar\t baz \tqux'

In [176]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [177]:
regex = re.compile('\s+')

In [178]:
regex

re.compile(r'\s+', re.UNICODE)

In [180]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [181]:
regex.findall(text)

[' ', '\t ', ' \t']